export const orders = {
  default: [0, 1, 2, 3, 4, 5, 6, 7],
  exhilarated: [1, 0, 2, 3, 7, 4, 6, 5],
  sadness: [4, 7, 6, 5, 3, 1, 0, 2]
};
// 0 경이 1 기쁨 2 애정 3 평안 4 슬픔 5 미움 6 걱정 7 부끄러운
export const list = {
  // 경이
  0: [
    "재미있는",
    "즐거운",
    "짜릿한",
    "흥겨운",
    "흥미로운",
    "경이로운",
    "신기한",
    "뭉클한",
    "신비로운"
  ],
  // 기쁨
  1: [
    "만족스러운",
    "좋은",
    "행복한",
    "홀가분한",
    "흐뭇한",
    "감격스러운",
    "기쁜",
    "뿌듯한",
    "통쾌한"
  ],
  // 애정
  2: [
    "감사한",
    "고마운",
    "기특한",
    "대견한",
    "든든한",
    "반가운",
    "사랑스러운",
    "애틋한",
    "자랑스러운"
  ],
  // 평안
  3: [
    "담담한",
    "편안한",
    "평화로운",
    "안심되는",
    "여유로운",
    "안정되는",
    "나른한",
    "온화한",
    "포근한"
  ],
  // 슬픔
  4: [
    "비참한",
    "서러운",
    "서운한",
    "속상한",
    "슬픈",
    "쓸쓸한",
    "외로운",
    "우울한",
    "허탈한"
  ],
  // 미움
  5: [
    "화나는",
    "어이없는",
    "억울한",
    "원망스러운",
    "짜증나는",
    "괴로운",
    "괘씸한",
    "답답한",
    "미운"
  ],
  // 걱정
  6: [
    "끔찍한",
    "불만스러운",
    "싫은",
    "한심한",
    "귀찮은",
    "불행한",
    "지겨운",
    "불안한",
    "두려운"
  ],
  // 부끄러움
  7: [
    "섭섭한",
    "실망스러운",
    "아쉬운",
    "안타까운",
    "후회되는",
    "당황스러운",
    "혼란스러운",
    "민망한",
    "부끄러운"
  ]
};
