export const MaxLevel = 23;
export const EndLevel = 25;

export const MessageScript = {
  0: [
    "@@님의 감정 표현 정도를 더 정확하게 알려줄 수 있는 테스트에요",
    "총 23개의 문항으로 이루어져 있어요.",
    "테스트 해보시겠어요?"
  ],
  1: [
    "1. @@님이 어떤 감정을 느끼고 있는지 자주 혼동하시나요?"
  ],
  2: [
    "2. @@님의 기분(감정)을 적절한 말로 표현하는 것이 어려우신가요?"
  ],
  3: [
    "3. 의사들조차도 이해하지 못하는 신체적인 감각을 느끼신 적이 있나요?"
  ],
  4: [
    "4. @@님의 기분을 쉽게 말로 표현하실 수 있나요?"
  ],
  5: [
    "5. @@님이 겪는 문제들을 표면적으로 보고 넘기기 보다는 꼼꼼하게 분석하고 짚고 넘어가는 것을 더 좋아하시나요?"
  ],
  6: [
    "6. @@님의 기분이 상했을 때 슬픈지, 두려운지, 화가 난 건지 잘 구분이 안 되시나요?"
  ],
  7: [
    "7. @@님의 몸에서 느껴지는 감각 때문에 종종 당황할 때가 있으신가요?"
  ],
  8: [
    "8. @@님한테 어떠한 일이 일어났을 때, 왜 그런 일이 일어났는지 알아보는 것 보다 그냥 그런가 보다 하고 넘기시는 편인가요?"
  ],
  9: ["9. 알 수 없는 감정(기분)을 느끼시나요?"],
  10: [
    "10. @@님은 진지한 소설책 보다 가볍게 읽을 수 있는 주간지나 스포츠신문이 더 마음에 드시나요?"
  ],
  11: [
    "*50% 진행되었어요! 조금만 더 힘내세요!",
    "11. @@님의 주변 사람들에 대한 @@님의 느낌을 말로 나타내기 힘드시지는 않나요?"
  ],
  12: [
    "12. 혹시 @@님의 주변 사람들이 @@님이 감정표현을 별로 안한다고 생각하지는 않나요?"
  ],
  13: ["13. @@님의 속마음을 모르시겠나요?"],
  14: [
    "14. @@님이 화났을 때 왜 화가 났는지 모르는 때가 종종 있나요?"
  ],
  15: [
    "15. 다른 사람들의 기분(감정)이 어떤지 알아보는 것 보다 일상 행동에 대해 대화하는 것을 더 좋아하시나요?"
  ],
  16: [
    "16. 인간 심리를 다루는 드라마 보다는 가벼운 오락 쇼를 보는 것을 더 좋아하시나요?"
  ],
  17: [
    "17. @@님의 친한 친구에게도 @@님의 감정을 표현하기 어려우신가요?"
  ],
  18: [
    "18. 영화나 연극을 볼 때, 인간의 내면세계를 상징적으로 나타내는 서사를 이해하기 어려우신가요?"
  ],
  19: [
    "19. 어떤 문제가 생겼을 때, @@님의 감정상태를 잘 파악하면 문제해결에 도움이 된다고 생각하시나요?"
  ],
  20: [
    "20. 영화를 볼 때 일일이 그 의미를 이해하려 하면 재미가 없어지나요?"
  ],
  21: [
    "21. @@님은 @@님의 감정을 다른 사람들에게 쉽게 내보여줄 수 있나요?"
  ],
  22: [
    "22. 한 개인의 인생 역경을 섬세하게 보여주는 다큐멘터리 보다는 액션이나 오락영화를 더 좋아하시나요?"
  ],
  23: [
    "23. @@님은 평소에 @@님의 감정을 잘 표현하지 못 하시나요?"
  ],
  24: [
    "수고하셨어요! 검사가 끝났어요.",
    "**분석중**"
  ],
  25: ["네 그럼 다음에 봬요!"]
};

export const BlockScript = {
  0: ["응"],
  1: [
    "전혀 혼동하지 않아요",
    "혼동하지 않아요",
    "가끔 그래요",
    "종종 혼동해요",
    "매우 혼동해요"
  ],
  2: [
    "전혀 어렵지 않아요",
    "어렵지 않아요",
    "가끔 어려워요",
    "종종 어려워요",
    "매우 어려워요"
  ],
  3: [
    "전혀 그런 적 없어요",
    "그런 적 없는 것 같아요",
    "가끔 그래요",
    "자주 그래요",
    "매 번 그래요"
  ],
  4: [
    "매우 잘해요",
    "잘해요",
    "보통이에요",
    "잘 못해요",
    "전혀 못해요"
  ],
  5: [
    "꼭 짚고 넘어가야 해요",
    "짚고 넘어가는 것을 좋아해요",
    "반반 이에요",
    "보고 넘기는 걸 좋아해요",
    "항상 보고 넘겨요"
  ],
  6: [
    "잘 구분해요",
    "구분할 수 있어요",
    "반반 이에요",
    "구분하기 어려워요",
    "전혀 구분 못해요"
  ],
  7: [
    "전혀 당황한 적 없어요",
    "당황한 적 없는 것 같아요",
    "가끔 당황해요",
    "자주 당황해요",
    "매 번 당황해요"
  ],
  8: [
    "꼭 알아봐요",
    "알아보는 편이에요",
    "반반 이에요",
    "그냥 넘겨요",
    "항상 넘겨요"
  ],
  9: [
    "전혀 느낀 적 없어요",
    "느낀 적 없는 것 같아요",
    "반반 이에요",
    "자주 느껴요",
    "매 번 느껴요"
  ],
  10: [
    "소설책을 선호해요",
    "소설책을 선호하는 편이에요",
    "반반 이에요",
    "주간지를 선호하는 편이에요",
    "주간지 선호해요"
  ],
  11: [
    "전혀 힘들지 않아요",
    "힘들지 않은 편이에요",
    "반반 이에요",
    "힘들어요",
    "매우 힘들어요"
  ],
  12: [
    "전혀 그렇게 생각하지 않아요",
    "그렇게 생각하지 않는 것 같아요",
    "반반 이에요",
    "그렇게 생각하는 것 같아요",
    "항상 그렇게 생각해요"
  ],
  13: [
    "매우 잘 알아요",
    "알아요",
    "반반 이에요",
    "모르겠어요",
    "전혀 모르겠어요"
  ],
  14: [
    "매우 잘 알아요",
    "알아요",
    "반반 이에요",
    "모르겠어요",
    "전혀 모르겠어요"
  ],
  15: [
    "감정 파악을 선호해요",
    "감정 파악을 선호하는 편이에요",
    "반반 이에요",
    "일상 대화를 좋아하는 편이에요",
    "일상 대화를 선호해요"
  ],
  16: [
    "심오한 드라마를 좋아해요",
    "심오한 드라마를 좋아하는 편이에요",
    "반반 이에요",
    "가벼운 오락쇼를 좋아하는 편이에요",
    "가벼운 오락쇼를 좋아해요"
  ],
  17: [
    "전혀 어렵지 않아요",
    "어렵지 않은 편이에요",
    "반반 이에요",
    "어려워요",
    "너무 어려워요"
  ],
  18: [
    "상징적 서사를 매우 잘 이해해요",
    "상징적 서사를 잘 이해하는 편이에요",
    "반반 이에요",
    "이해하기 어려운 편이에요",
    "이해하기 너무 어려워요"
  ],
  19: [
    "매우 도움이 돼요",
    "도움 되는 편이에요",
    "반반 이에요",
    "도움이 안되는 것 같아요",
    "전혀 도움 안돼요"
  ],
  20: [
    "의미를 이해하면 훨씬 재미있어요",
    "더 재미있는 편이에요",
    "반반 이에요",
    "재미가 없어져요",
    "정말 재미 없어져요"
  ],
  21: [
    "매우 쉽게 보여줘요",
    "보여줄 수 있어요",
    "반반 이에요",
    "보여주기 어려워요",
    "못 보여 주겠어요"
  ],
  22: [
    "다큐멘터리가 훨씬 좋아요",
    "다큐멘터리를 선호하는 편이에요",
    "반반 이에요",
    "오락 영화를 선호하는 편이에요",
    "오락 영화가 훨씬 좋아요"
  ],
  23: [
    "매우 잘 표현해요",
    "잘 표현하는 편이에요",
    "반반 이에요",
    "표현 못하는 편이에요",
    "전혀 표현 못해요"
  ],
  24: ["풀고래랑 대화하기", "다음에 할래"]
};

export const MessageDelay = {
  0: [1000, 1000, 1000],
  1: [100],
  2: [100],
  3: [100],
  4: [100],
  5: [100],
  6: [100],
  7: [100],
  8: [100],
  9: [100],
  10: [100],
  11: [100, 100],
  12: [100],
  13: [100],
  14: [100],
  15: [100],
  16: [100],
  17: [100],
  18: [100],
  19: [100],
  20: [100],
  21: [100],
  22: [100],
  23: [100],
  24: [100, 100, 100, 100, 100],
  25: [100]
};
